# 个人资料 - [mr-012-qas]

## 基本资料

- 姓名：[梁文栋]
- 学号：[2607140120]
- 专业：[信息安全]
- GitHub：[https://github.com/mr-012-qas]
- 意向方向：[后端开发]
- 技术基础：[了解python，会使用Claude解决问题]

## 关于我

### 为什么想要加入技术组？

[我从小就对编程语言有浓厚的学习兴趣，特别是python，c,cpp等，目标就是进组参加学习然后参加比赛，技术组里的人的技术水平都很高]

### 最近一次主动学习某项新东西的经历

- 学习内容：[学西了python，怎样安装git,codex,claude,visual studio code(Vs code)]
- 学习动机：[想要参加比赛，提升自己的实力]
- 学习过程与结果：[通过网课和书籍学西，遇到了安装Claude路径错误的问题，但最终成功通过deep seek的API key安装上了，另外还有qq名为Zephyros学长的指路]

### 感兴趣的技术方向

[我对人工智能和后端比较感兴趣]

### 平时如何使用 AI？

[我一般在遇到棘手问题，或者思考不出来答案的时候去问豆包，我会先通过实践的方式去验证答案]

### 如果 AI 给出的答案明显不对，你会怎么处理？

[如果通过ai的答案最后没有正确的运行某些程序，我就断定答案不对，这时，我会先反思自己的提问方式是否出现问题，更改更清晰有逻辑提问方式]

## 技术资源

- 资源名称：[小甲鱼]
- 链接：[https://fishc.com.cn/forum-360-1.html]
- 我是如何找到它的：[b站上找的]
- 为什么值得参考：[因为小甲鱼自创了一个网站即fish.com里面有各种计算机编程语言资源]

## AI 辅助记录

### 1. 我遇到的问题

[当我需要一个API key 时，因为kimi需要预约，时间不等人，所以向豆包请问还有什么ai让我可以立刻获取到]

### 2. 我是怎么向 AI 提问的

[从哪里可以获取deep seek的的base URL]

### 3. AI 的回答有没有直接解决？

[有效，最终成功安装上了claude]

### 4. 如果没有，我后来怎么继续处理？

[我可能会向学长请教，最终可以取得成功]